# PolymeshFacet Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PolymeshFacet Methods
PolymeshFacet Class See Also
---
The PolymeshFacet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetVertices | Returns the three vertices that define this facet |
| ToString | Returns formatted string showing (V1, V2, V3) with values formatted as regular integers  (Overrides Object..::..ToString()()()().) |

# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace